In [17]:
import pandas as pd
import numpy as np
import tabulate as tab

dataset = pd.read_csv('titanic.csv')
dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
test_dataset = pd.read_csv('titanic_test.csv')
test_dataset

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [19]:
train_data = dataset[["Age","Fare"]].dropna(subset=["Age","Fare"])
train_data

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
885  39.0  29.1250
886  27.0  13.0000
887  19.0  30.0000
889  26.0  30.0000
890  32.0   7.7500

[714 rows x 2 columns]

In [20]:
train_label = dataset[["Age","Fare","Survived"]].dropna(subset=["Age","Fare"])
train_label = train_label["Survived"]
train_label

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 714, dtype: int64

In [21]:
import numbers
test_data = test_dataset[["Age","Fare"]]
deletedIdx = []
for i in range(0, len(test_data)):
    if test_data["Age"][i] >= 0 and test_data["Fare"][i] >= 0:
        pass
    else:
        deletedIdx.append(i)

test_data = test_data.dropna(subset=['Age',"Fare"])
test_data

      Age      Fare
0    34.5    7.8292
1    47.0    7.0000
2    62.0    9.6875
3    27.0    8.6625
4    22.0   12.2875
..    ...       ...
409   3.0   13.7750
411  37.0   90.0000
412  28.0    7.7750
414  39.0  108.9000
415  38.5    7.2500

[331 rows x 2 columns]

In [22]:
test_label = pd.read_csv('titanic_testlabel.csv')["Survived"]
test_label = test_label.drop(deletedIdx)
test_label

0      0
1      1
2      0
3      0
4      1
      ..
409    1
411    1
412    1
414    1
415    0
Name: Survived, Length: 331, dtype: int64

In [23]:
# Hapus missing data
train_data = train_data.dropna()
# ========================================
print(
    tab.tabulate([
        ['Age', train_data["Age"].min(), train_data["Age"].max()],
        ['Fare', train_data["Fare"].min(), train_data["Fare"].max()]
    ], headers=['Data','Min','Max'], tablefmt='fancy_grid')
)

╒════════╤═══════╤═════════╕
│ Data   │   Min │     Max │
╞════════╪═══════╪═════════╡
│ Age    │  0.42 │  80     │
├────────┼───────┼─────────┤
│ Fare   │  0    │ 512.329 │
╘════════╧═══════╧═════════╛

In [24]:
minVal = 0
maxVal = 1

train_data["Age"] = (
    train_data["Age"] -
    train_data["Age"].min() * (maxVal-minVal) /
    (train_data["Age"].max()-train_data["Age"].min()) + minVal
)

minAge = train_data["Age"].min()
maxAge = train_data["Age"].max()
print("Min Age: " + str(minAge))
print("Max Age: " + str(maxAge))


train_data["Fare"] = (
    train_data["Fare"] -
    train_data["Fare"].min() * (maxVal-minVal) /
    (train_data["Fare"].max()-train_data["Fare"].min()) + minVal
)

minFare = train_data["Fare"].min()
maxFare = train_data["Fare"].max()
print("Min Fare: " + str(minFare))
print("Max Fare: " + str(maxFare))

Min Age: 0.4147222920331741
Max Age: 79.99472229203317
Min Fare: 0.0
Max Fare: 512.3292

In [27]:
test_data["Age"] = (
    test_data["Age"] -
    test_data["Age"].min() * (maxAge-minAge) /
    (test_data["Age"].max()-test_data["Age"].min()) + minAge
)
print("Min Age: " + str(test_data["Age"].min()))
print("Max Age: " + str(test_data["Age"].max()))

test_data["Fare"] = (
    test_data["Fare"] -
    test_data["Fare"].min() * (maxFare-minFare) /
    (test_data["Fare"].max()-test_data["Fare"].min()) + minFare
)
print("Min Fare: " + str(test_data["Fare"].min()))
print("Max Fare: " + str(test_data["Fare"].max()))

Min Age: 0.39462889253315364
Max Age: 76.22462889253316
Min Fare: 0.0
Max Fare: 512.3292

In [28]:
from sklearn.preprocessing import StandardScaler
from sklearn.neighbors import KNeighborsClassifier

xtrain = train_data
xtest = test_data
ytrain = train_label
ytest = test_label

scaler = StandardScaler()
scaler.fit(xtrain)

xtrain = scaler.transform(train_data)
xtest = scaler.transform(test_data)

# =====================================================

classifier = KNeighborsClassifier(n_neighbors=3)
classifier.fit(xtrain, ytrain)

ypred = classifier.predict(xtest)
ypred

array([0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0,
       1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0,
       0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1,
       1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1,
       0])

In [29]:
from sklearn.metrics import classification_report, confusion_matrix

print(confusion_matrix(ytest, ypred))
print(classification_report(ytest, ypred))

[[128  76]
 [ 69  58]]
              precision    recall  f1-score   support

           0       0.65      0.63      0.64       204
           1       0.43      0.46      0.44       127

    accuracy                           0.56       331
   macro avg       0.54      0.54      0.54       331
weighted avg       0.57      0.56      0.56       331